#include "f.h"

void stat()
{

C sc = rec();

printf("\n");
printf("%s__________________________________________%s\n",GREEN,NONE);
printf("%s|-------------СВОДНАЯ ТАБЛИЦА------------|%s\n",GREEN,NONE);
printf("%s|________________________________________|%s\n",GREEN,NONE);
printf("%s|КОПИЛКА | ДОСТОИНСТВО |  МОНЕТ/РУБ.     |%s\n",GREEN,NONE);
printf("%s|--------|-------------|-----------------|%s\n",GREEN,NONE);
printf("%s|РАКЕТА  |     10      |   %d/%d          %s\n",GREEN,sc.sc10 ,sc.sc10*10,NONE);
printf("%s|РАКЕТА  |     5       |   %d/%d          %s\n",GREEN,sc.sc5,sc.sc5*5,NONE);
printf("%s|--------|-------------|------------------%s\n",GREEN,NONE);
printf("%s|БЕЛАЯ   |     2       |   %d/%d          %s\n",GREEN,sc.sc2,sc.sc2*2,NONE);
printf("%s|БЕЛАЯ   |     1       |   %d/%d          %s\n",GREEN,sc.sc1,sc.sc1,NONE);
printf("%s|--------|-------------|------------------%s\n",GREEN,NONE);
printf("%s|ПИН     |     0.5     |   %d/%4.1f          %s\n",GREEN,sc.sc05,sc.sc05*0.5,NONE);
printf("%s|ПИН     |     0.1     |   %d/%4.1f          %s\n",GREEN,sc.sc01,sc.sc01*0.1,NONE);
printf("%s|ПИН     |     0.05    |   %d/%4.2f          %s\n",GREEN,sc.sc005,sc.sc005*0.05,NONE);
printf("%s|ПИН     |     0.01    |   %d/%4.2f          %s\n",GREEN,sc.sc001,sc.sc001*0.01,NONE);
printf("%s|________|_____________|__________________%s\n",GREEN,NONE);
printf("%s|РАКЕТА: %d руб.%s\n",GREEN,sc.rub10,NONE);
printf("%s|БЕЛАЯ: %d руб.%s\n",GREEN,sc.rub2,NONE);
printf("%s|ПИН: %4.2f руб.\n%s",GREEN,sc.rub01,NONE);
printf("%s|%s\n",GREEN,NONE);
printf("%s|ИТОГ: %4.2f руб.\n%s",GREEN,sc.sum,NONE);
printf("%s|________________________________________|%s\n",GREEN,NONE);
printf("  %sНажмите ENTER, чтобы вернуться в меню%s",GREEN,NONE);
printf("\n");
getchar();


}

/*
printf("__________________________________________________________\n");
printf("|-------------------- СВОДНАЯ ТАБЛИЦА--------------------|\n");
printf("|________________________________________________________|\n");
printf("|КОПИЛКА | ДОСТОИНСТВО |  МОНЕТ  |   РУБЛЕЙ   |  ВСЕГО   |\n");
printf("|--------|-------------|---------|------------|----------|\n");
printf("|РАКЕТА  |     10      |   %d    | %d         |%d        |\n", sc10,sc10*10,rub10);
printf("|РАКЕТА  |     5       |   %d    | %d         |          |\n", sc5,sc5*5);
printf("|--------|-------------|---------|------------|----------|\n");
printf("|БЕЛАЯ   |     2       |   %d    | %d	      |%d        |\n", sc2,sc2*2,rub2);
printf("|БЕЛАЯ   |     1       |   %d    | %d	      |          |\n", sc1,sc1);
printf("|--------|-------------|---------|------------|----------|\n");
printf("|ПИН     |     0.5     |   %d    | %d	      |          |\n", sc05,sc05*0.5);
printf("|ПИН     |     0.1     |   %d    | %d	      |%d        |\n", sc01,sc01*0.1,rub01);
printf("|ПИН     |     0.05    |   %d    | %d 	      |          |\n", sc005,sc005*0.05);
printf("|ПИН     |     0.01    |   %d    | %d	      |          |\n", sc001,sc001*0.01);
printf("|________|_____________|_________|____________|__________|\n");
printf("|ИТОГ:...........................................%d      |\n",rub10+rub2+rub01);
printf("|________________________________________________________|\n");
*/
